BEGIN;

-- 1.
SELECT
	"Н_ЛЮДИ"."ФАМИЛИЯ",
	"Н_ВЕДОМОСТИ"."ИД"
FROM
	"Н_ЛЮДИ"
	INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ИД"
WHERE
	"Н_ЛЮДИ"."ИД" = 163484
	AND "Н_ВЕДОМОСТИ"."ИД" > 1490007;

-- 2.
SELECT
	"Н_ЛЮДИ"."ИМЯ",
	"Н_ОБУЧЕНИЯ"."ЧЛВК_ИД",
	"Н_УЧЕНИКИ"."ИД"
FROM
	"Н_ЛЮДИ"
	INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
	INNER JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE
	"Н_ЛЮДИ"."ОТЧЕСТВО" = 'Сергеевич'
	AND CAST("Н_ОБУЧЕНИЯ"."НЗК" AS INTEGER) > 933232
	AND "Н_УЧЕНИКИ"."НАЧАЛО" < '2011-11-21';

-- 3.
SELECT
	COUNT(*)
FROM
	"Н_ЛЮДИ"
	JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
	JOIN "Н_ГРУППЫ_ПЛАНОВ" ON "Н_УЧЕНИКИ"."ГРУППА" = "Н_ГРУППЫ_ПЛАНОВ"."ГРУППА"
	JOIN "Н_ПЛАНЫ" ON "Н_ГРУППЫ_ПЛАНОВ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
	JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
WHERE
	"Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ'
	AND EXTRACT(
		YEAR
		FROM
			AGE (CURRENT_DATE, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")
	) > 25;

-- 4.
SELECT
	Н_ГРУППЫ_ПЛАНОВ."ПЛАН_ИД"
FROM
	"Н_ГРУППЫ_ПЛАНОВ"
	JOIN "Н_ПЛАНЫ" ON Н_ГРУППЫ_ПЛАНОВ."ПЛАН_ИД" = Н_ПЛАНЫ."ИД"
	JOIN "Н_ОТДЕЛЫ" ON Н_ПЛАНЫ."ОТД_ИД" = Н_ОТДЕЛЫ."ИД"
WHERE
	Н_ОТДЕЛЫ."КОРОТКОЕ_ИМЯ" = 'ВТ'
GROUP BY
	Н_ГРУППЫ_ПЛАНОВ."ПЛАН_ИД"
HAVING
	COUNT(Н_ГРУППЫ_ПЛАНОВ."ГРУППА") > 2;

-- 5.
SELECT
	"Н_УЧЕНИКИ"."ГРУППА",
	AVG(DATE_PART('year', AGE ("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
FROM
	"Н_ЛЮДИ"
	JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
GROUP BY
	"Н_УЧЕНИКИ"."ГРУППА"
HAVING
	AVG(DATE_PART('year', AGE ("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))) < (
		SELECT
			MIN(DATE_PART('year', AGE ("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")))
		FROM
			"Н_ЛЮДИ"
			JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
		WHERE
			"Н_УЧЕНИКИ"."ГРУППА" = '1100'
	);

-- 6.
SELECT
	"Н_УЧЕНИКИ"."ГРУППА",
	"Н_ЛЮДИ"."ИД" AS "Номер",
	"Н_ЛЮДИ"."ФАМИЛИЯ",
	"Н_ЛЮДИ"."ИМЯ",
	"Н_ЛЮДИ"."ОТЧЕСТВО",
	"Н_УЧЕНИКИ"."П_ПРКОК_ИД"
FROM
	"Н_ЛЮДИ"
	JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
	JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
	JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
WHERE
	"Н_УЧЕНИКИ"."ИД" IN (
		SELECT
			"Н_УЧЕНИКИ"."ИД"
		FROM
			"Н_УЧЕНИКИ"
			JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
			JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
		WHERE
			"Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
			AND "Н_УЧЕНИКИ"."СОСТОЯНИЕ" = 'утвержден'
			AND DATE ("Н_УЧЕНИКИ"."КОНЕЦ") < '2012-09-01'
			AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
	);

-- 7.
SELECT DISTINCT
	A."ИД",
	A."ФАМИЛИЯ",
	A."ДАТА_РОЖДЕНИЯ"
FROM
	"Н_ЛЮДИ" A
	JOIN "Н_ЛЮДИ" B ON A."ФАМИЛИЯ" = B."ФАМИЛИЯ"
	AND A."ДАТА_РОЖДЕНИЯ" <> B."ДАТА_РОЖДЕНИЯ"
	AND A."ИД" <> B."ИД"
ORDER BY
	A."ФАМИЛИЯ";

END;
