<head>
  <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script>
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
      skipTags: ['script', 'noscript', 'style', 'textarea', 'pre'],
      inlineMath: [['$','$']]
      }
    });
  </script>
</head>

## [MainPage](../READEME.md)/[Program](readme.mdreadme)/lab1
# Лабораторная работа #1

Написать программу на языке Java, выполняющую соответствующие варианту действия. Программа должна соответствовать следующим требованиям:

1. Она должна быть упакована в исполняемый jar-архив.
2. Выражение должно вычисляться в соответствии с правилами вычисления математических выражений (должен соблюдаться порядок выполнения действий и т.д.).
3. Программа должна использовать математические функции из стандартной библиотеки Java.
4. Результат вычисления выражения должен быть выведен в стандартный поток вывода в заданном формате.

Выполнение программы необходимо продемонстрировать на сервере `helios`.

**Отчёт по лабораторной работе должен содержать:**

1. Текст задания.
2. Исходный код программы.
3. Результат работы программы.
4. Выводы по работе.

**Вопросы к защите лабораторной работы:**

1. Язык Java. Особенности языка.
2. Средства разработки. JDK и JRE.
3. Примитивные типы данных в Java.
4. Работа с переменными. Декларация. Инициализация. Присваивание.
5. Инструкции ветвления и циклов.
6. Операторы и выражения в Java. Особенности вычисления, приоритеты операций.
7. Математические функции в составе стандартной библиотеки Java. Класс `java.lang.Math`.
8. Форматированный вывод числовых данных.

Примереые варианты:

**Вариант 1**

1. Создать одномерный массив `d` типа `int`. Заполнить его нечётными числами от 3 до 25 включительно в порядке возрастания.
2. Создать одномерный массив `x` типа `double`. Заполнить его 15-ю случайными числами в диапазоне от -6.0 до 8.0.
3. Создать двумерный массив `d` размером 12x15. Вычислить его элементы по следующей формуле (где `x = x[j]`)
  - если $d[i] = 19$, то  
   
    $$d[i][j] = \left(\arctan\left(0.2\cdot\frac{x+1}{14}\right)\right)^{\frac{0.25}{\arcsin(e^{-\lvert x\rvert})-1}}$$

  - если $d[i] \in \{5, 9, 11, 13, 17, 23\}$, то  
   
    $$d[i][j] = \cos(\cos(\sqrt[3]{x}))$$

  - для остальных значений $d[i]$:  
   
    $$d[i][j]=\left(0.25-\left(\sqrt[3]{(x)^{x-\frac{3}{4}}}\right)^{3+\cos(\sqrt[3]{x})}\right)^{\arcsin\left(e^{\sqrt[3]{-(\frac{4}{\lvert x\rvert}})^x}\right)}$$

4. Напечатать полученный в результате массив в формате с четырьмя знаками после запятой.

**Вариант 7**

1. Создать одномерный массив d типа int. Заполнить его чётными числами от 4 до 16 включительно в порядке убывания.
2. Создать одномерный массив x типа float. Заполнить его 10-ю случайными числами в диапазоне от -10.0 до 5.0.
3. Создать двумерный массив d размером 7x10. Вычислить его элементы по следующей формуле (где x = x[j]):
  - если $d[i] = 10$, то  
   
    $$d[i][j]=\arcsin(0.2⋅\cos(x))$$

  - если $d[i] \in \{8, 12, 14\}$, то  
   
    $$d[i][j]=\cos\left(\arctan\left(\frac{1}{e^{\lvert x\rvert}}\right)\right)$$

  - для остальных значений $d[i]$:  
   
    $$d[i][j]=\sin\left(\frac{\left(\arcsin\left(\frac{x−2.5}{15}\right)\cdot (1−\ln(\lvert x\rvert))\right)^{(x)^{\frac{x}{2}}}}{4}\right)$$

4. Напечатать полученный в результате массив в формате с тремя знаками после запятой.

**Вариант 9**

1. Создать одномерный массив `d` типа `int`. Заполнить его числами от 5 до 19 включительно в порядке убывания.
2. Создать одномерный массив `x` типа `float`. Заполнить его 18-ю случайными числами в диапазоне от -5.0 до 10.0.
3. Создать двумерный массив `d` размером 15x18. Вычислить его элементы по следующей формуле (где `x = x[j]`):
  - если $d[i] = 17$, то  
   
    $$d[i][j]=e^{\arctan(\sin(x))}$$

  - если $d[i] \in \{5, 7, 8, 9, 11, 13, 16\}$, то  
   
    $$d[i][j]=\left(2\cdot \sin\left(\arcsin\left(\frac{x+2.5}{15}\right)\right)\right)^{\tan\left(\arcsin\left(\frac{x+2.5}{15}\right)\right)}$$

  - для остальных значений $d[i]$:  
   
    $$d[i][j]=\left(\frac{\sin\left(\cos\left(\frac{2}{3}\cdot(x−1)\right)\right)}{2}/3\right)^{\frac{e^{\ln(\lvert x\rvert)−3}}{1}/2}$$
    
4. Напечатать полученный в результате массив в формате с тремя знаками после запятой.


### Решение варианта 7:
```
import java.util.Random;

public class lab1 {
    public static void main(String[] args) {
        int d[] = new int[7];
        int b = 16;
        for (int i = 0; i < 7; i++) {
            d[i] = b;
            b -= 2;
        }
        System.out.println("一维数组为:");
        for (int i = 0; i < 7; i++) {
            System.out.println(d[i] + "");
        }
        Random arr = new Random();
        float max = 5.0f;
        float min = -10.0f;
        float x[] = new float[10];
        for (int i = 0; i < 10; i++) {
            x[i] = min + arr.nextFloat(max - min + 1);
        }
        System.out.println("十个随机数为:");
        for (int i = 0; i < 10; i++) {
            System.out.println(x[i] + "");
        }
        double[][] n = new double[7][10]; // 定义数组空间
        for (int i = 0; i < 7; i++) {
            for (int j = 0; j < 10; j++) {
                if (d[i] == 10) {
                    n[i][j] = Math.asin(0.2 * Math.cos(x[j]));
                } else if (d[i] == 8 || d[i] == 12 || d[i] == 14) {
                    double e = Math.E;
                    n[i][j] = Math.cos(Math.atan(1 / Math.pow(e, Math.abs(x[j]))));
                } else {
                    n[i][j] = Math.sin(Math.pow(Math.pow((Math.asin(x[j]-2.5/15))*(1-Math.log(Math.abs(x[j]))),x[j]),x[j]/2));
                }
            }
        }
        System.out.println("二维数组为：");
        for (int i = 0; i < 7; i++) {
            for (int j = 0; j < 10; j++) {
                System.out.print(n[i][j] + "");
            }
            System.out.println();
        }
    }
}
```